app/controllers/api/v1/key_ingredients_controller.rb

SELECT "key_ingredients".* FROM "key_ingredients"
---
    def index
        ingredients = KeyIngredient.all