app/controllers/api/v1/product_ingredients_controller.rb

    def index
        product_ingredients = ProductIngredient.all
---
SELECT "product_ingredients".* FROM "product_ingredients"

    def show
        product_ingredient = ProductIngredient.find(params[:id])
---
SELECT "key_ingredients".* FROM "key_ingredients" WHERE "key_ingredients"."id" = $1 LIMIT $2  [["id", 292], ["LIMIT", 1]]