app/controllers/api/v1/products_controller.rb

    def index
        products = Product.all
---
SELECT "products".* FROM "products"

    def show
        product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]